app/controllers/orders_controller.rb

SELECT "orders".* FROM "orders"  WHERE "orders"."user_id" = 22
---
def create
   session[:product_id]=params[:id]
   @address=Order.where(:user_id =>session[:user_id])

SELECT  "products".* FROM "products"  WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "orders".* FROM "orders"  WHERE "orders"."id" = ? LIMIT 1  [["id", 17]]
---
def order_info
    @product=Product.find(session[:product_id])
    @order=Order.find(params[:id])

INSERT INTO "orders" ("adress", "created_at", "p_id", "ph_no", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["adress", "kjshdka\r\nsakdaskld\r\n"], ["created_at", "2014-07-16 06:53:12.584019"], ["p_id", 4], ["ph_no", 12778127], ["updated_at", "2014-07-16 06:53:12.584019"], ["user_id", 17]]
---
def insert

	order = params[:order]
  p "-----------------------------"
	p session[:user_id]
	p session[:product_id]
  p @address
  p "-----------------------------"

	 @order= Order.new(:user_id => session[:user_id],:p_id=>session[:product_id],:ph_no=>order[:ph_no],:adress=>order[:adress])

    if (@order.save)