app/controllers/products_controller.rb

def profile
	@user=User.find(session[:user_id])
	@products=Product.find(Order.where(:user_id =>session[:user_id]).uniq.pluck(:p_id))
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 17]]
SELECT DISTINCT "orders"."p_id" FROM "orders"  WHERE "orders"."user_id" = 22