app/controllers/users_controller.rb

 def create
    @user=User.new(user_params)

 	if @user.save
---
INSERT INTO "users" ("created_at", "email", "name", "password", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-07-15 09:29:12.409532"], ["email", "ee@gmail.com"], ["name", "junkee"], ["password", "junkee"], ["updated_at", "2014-07-15 09:29:12.409532"]]

 def authenticate
 	user = User.find_by_name(params[:username_or_email])
---
SELECT  "users".* FROM "users"  WHERE "users"."name" = 'gggggg' LIMIT 1